# Using GROUP BY and Aggregation in SQL

### Review of SQL clauses

* SELECT * | col1 [, col2, ...]  -- corresponds to **project**
* FROM table [, table, ...]
* WHERE condition [AND|OR condition]   -- corresponds to **query**
* ORDER BY column [,column, ...] [DESC] -- corresponds to **sort**
* LIMIT numrows  -- corresponds to **head**

### Adding a GROUP BY clause

* comes after WHERE
* list the column or columns to squash
* The aggregate operator goes in the select clause
* Valid aggregates in SQL
* The groupby column **MUST** appear in the select clause as well
* NO other columns can be added, does not make sense!  Which rows would you keep??
* Valid aggregates in SQL

  * count(*)
  * avg
  * min
  * max
  * sum

### How many countries are in each region?

In [3]:
# all of your notebooks and homework using SQL are going to start something like this
import warnings
warnings.filterwarnings('ignore')
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [5]:
%sql postgresql://millbr02:@localhost/world

'Connected: millbr02@world'

In [6]:
%%sql

select region, count(*) from country group by region;

25 rows affected.

[('Micronesia/Caribbean', 1),
 ('Southern Africa', 5),
 ('Australia and New Zealand', 5),
 ('Southeast Asia', 11),
 ('Southern Europe', 15),
 ('Northern Africa', 7),
 ('Antarctica', 5),
 ('Nordic Countries', 7),
 ('Central Africa', 9),
 ('Micronesia', 7),
 ('Polynesia', 10),
 ('Western Europe', 9),
 ('Western Africa', 17),
 ('Caribbean', 24),
 ('Melanesia', 5),
 ('North America', 5),
 ('Eastern Europe', 10),
 ('Eastern Africa', 20),
 ('Middle East', 18),
 ('Southern and Central Asia', 14),
 ('British Islands', 2),
 ('Central America', 8),
 ('South America', 14),
 ('Baltic Countries', 3),
 ('Eastern Asia', 8)]

#### What is the average life expectancy for each continent

In [9]:
%%sql

UsageError: %%sql is a cell magic, but the cell body is empty. Did you mean the line magic %sql (single %)?

#### What is the max gnp for any country in each region?

In [ ]:
%%sql

#### What is the most popular form of government in Asia?

In [ ]:
%%sql

#### What is the most popular form of government in Asia with more than one country?

## Movies

In [13]:
from reframe import Relation

titles = Relation('/home/faculty/millbr02/pub/titles.csv',sep=',')
cast = Relation('/home/faculty/millbr02/pub/cast.csv',sep=',')
cast.head()

,title,year,name,type,character,n
0,Star Trek: First Contact,1996,Joey Anaya,actor,Borg,NaN
1,Apache Trail,1942,Donna Reed,actress,Rosalia Martinez,2
2,My Favorite Martian,1999,Michael Adler,actor,Scientist,39
3,Contact,1997,Jodie Foster,actress,Eleanor Arroway,3
4,Caddyshack,1980,Bill Murray,actor,Carl Spackler,5

In [17]:
from sqlalchemy import create_engine
eng = create_engine('postgresql://millbr02:@localhost/movies')
titles.to_sql('title',eng)